[{"title":"What is the difference between Normalize.css and Reset CSS?","description":"I know what CSS Reset is, but recently I heard about this new thing called Normalize.css What is the difference between Normalize.css and Reset CSS? What is the difference between normalizing CSS...","user_id":"Walter Augustine","link":"https://stackoverflow.com/questions/6887336/what-is-the-difference-between-normalize-css-and-reset-css"},{"title":"Cheetyr – CSS Selectors Cheat Sheet","description":"A handy collection of cheat sheets for designers and developers.","user_id":"Walter Augustine","link":"http://www.cheetyr.com/css-selectors"},{"title":"Pesticide for Chrome","description":"This extension inserts the Pesticide CSS into the current page, outlining each element to better see placement on the page.","user_id":"Walter Augustine","link":"https://chrome.google.com/webstore/detail/pesticide-for-chrome/bblbgcheenepgnnajgfpiicnbbdmmooh?hl=en-US"},{"title":"Buy Adobe Muse CC | Download HTML5 web design software free trial","description":"Create gorgeous HTML5 websites without writing code that dynamically scale to any device with Adobe Muse CC. Join today.","user_id":"Walter Augustine","link":"https://www.adobe.com/products/muse.html"},{"title":"Adobe Experience Design CC (Beta) | Prototyping &amp; Wireframing Tool","description":"Design and prototype websites and mobile apps with Adobe Experience Design CC (Beta), the first all-in-one solution for UX designers. Download now to get started.","user_id":"Walter Augustine","link":"https://www.adobe.com/products/experience-design.html"},{"title":"Wireframe.cc: Wireframe.cc - minimal wireframing tool","description":"A simple wireframing tool that doesn't get in your way. Create and share simple wireframes of websites and mobile apps.","user_id":"Thomas Murphy","link":"https://wireframe.cc/fcf5qn"},{"title":" CSS · Bootstrap ","description":"Bootstrap, a sleek, intuitive, and powerful mobile first front-end framework for faster and easier web development.","user_id":"Walter Augustine","link":"https://getbootstrap.com/css/#grid"},{"title":"Colorsublime","description":"Color your Sublime Text editor trying your favorite theme online before downloading it for free","user_id":"Walter Augustine","link":"http://colorsublime.com/"},{"title":"Launch Sublime Text 3 from the command line","description":"Thoughts on Ruby, Rails, open source software, programming, and life from Olivier Lacan","user_id":"Ed Orsini","link":"http://olivierlacan.com/posts/launch-sublime-text-3-from-the-command-line/"},{"title":"Bootstrap Grid","description":"The best friend of every Bootstrap user. Get a grid overlay on your website with a single click.","user_id":"Kelsey Hayes","link":"https://chrome.google.com/webstore/detail/bootstrap-grid/gmoboekiodfcajledjijioecfimliddo?hl=en"},{"title":"SitePoint: Truthy and Falsy: When All is Not Equal in JavaScript — SitePoint","description":"Anything in JavaScript can be considered to be either truthy or falsy. Craig provides a useful guide explaining what they are and the bizarre rules that apply when they're compared.","user_id":"Walter Augustine","link":"https://www.sitepoint.com/javascript-truthy-falsy/"},{"title":"GitHub: standard/eslint-config-standard","description":"eslint-config-standard - ESLint Config for JavaScript Standard Style","user_id":"Walter Augustine","link":"https://github.com/standard/eslint-config-standard"},{"title":"WakaTime: Metrics for programmers automatically generated from your coding activity","description":"Open-source text editor plugins for metrics about your programming.","user_id":"Walter Augustine","link":"https://wakatime.com/"},{"title":"multiple ajax calls wait for last one to load, then execute","description":"I have multiple ajax queries running at the same time, and I want them to wait for the last one to return, and then run the success handler on all of the ajax calls. For a simplified example, cons...","user_id":"Walter Augustine","link":"https://stackoverflow.com/questions/14465177/multiple-ajax-calls-wait-for-last-one-to-load-then-execute"},{"title":"CSS Guidelines","description":"High-level advice and guidelines for writing sane, manageable, scalable CSS","user_id":"Walter Augustine","link":"https://cssguidelin.es/"},{"title":"You Might Not Need jQuery","description":"Examples of how to do common event, element, ajax and utility operations with plain javascript.","user_id":"Walter Augustine","link":"http://youmightnotneedjquery.com/"},{"title":"Dash for macOS - API Documentation Browser, Snippet Manager - Kapeli","description":"Dash is an API Documentation Browser and Code Snippet Manager. Dash searches offline documentation of 150+ APIs and stores snippets of code. You can also generate your own documentation sets.","user_id":"Walter Augustine","link":"https://kapeli.com/dash"},{"title":"Trello","description":"Infinitely flexible. Incredibly easy to use. Great mobile apps. It's free. Trello keeps track of everything, from the big picture to the minute details.","user_id":"Walter Augustine","link":"https://trello.com/"},{"title":"Grid Garden","description":"A game for learning CSS grid layout","user_id":"Ross Blair","link":"http://cssgridgarden.com/"},{"title":"Which is better, number(x) or parseFloat(x)?","description":"Which is better? I'm asking this just for the sake of shaving a few bytes, as I can use +x instead of number(x). Does parsefloat do something better? EDIT: Verdict - parseFloat. Even if using +...","user_id":"Michael Alley","link":"https://stackoverflow.com/questions/12227594/which-is-better-numberx-or-parsefloatx"},{"title":"YouTube Video: CSS Grid Changes EVERYTHING - Amazing Presentation","user_id":"Walter Augustine","link":"https://www.youtube.com/watch?v=7kVeCqQCxlk"},{"title":"Code Envato Tuts+: Team Collaboration With GitHub","description":"GitHub has become the corner stone for all things open source software. Developers love it, collaborate on it and are constantly building awesome projects through it. Apart from hosting our code,...","user_id":"Walter Augustine","link":"https://code.tutsplus.com/articles/team-collaboration-with-github--net-29876"},{"title":"            GitHub Flow –          Scott Chacon   ","description":"Some information by and about Scott Chacon","user_id":"Walter Augustine","link":"http://scottchacon.com/2011/08/31/github-flow.html"},{"title":"Flexbox Froggy","description":"A game for learning CSS flexbox","user_id":"Walter Augustine","link":"http://flexboxfroggy.com/"},{"title":"Wireframe.cc: Wireframe.cc - minimal wireframing tool","description":"A simple wireframing tool that doesn't get in your way. Create and share simple wireframes of websites and mobile apps.","user_id":"Walter Augustine","link":"https://wireframe.cc/"},{"title":"TechCrunch Link: With 200M daily users, Giphy will soon test sponsored&nbsp;GIFs","description":"And it&rsquo;s about time.\nGiphy, the four-year-old search engine for GIFs, is going to finally start testing monetization.\nAccording to a source close to the company, Giphy will begin testing sponsored GIFs within messaging experiences. This means that users who search for GIFs may be served a sponsored GIF within the messaging tab.\nThere are some obvious use-cases here: A search for &ldquo;Monday&rdquo; or &ldquo;morning&rdquo; might turn up a Starbucks GIF. But there is also an opportunity for brands, especially movies and TV shows (which makes up a huge portion of Giphy&rsquo;s content), to work their existing content into people&rsquo;s messages.\nStructurally, this isn&rsquo;t too different from what Google does with search terms. If you search for &ldquo;Walmart,&rdquo; you&rsquo;ll more than likely see a sponsored listing for both Walmart and Target.\nWith Giphy, however, searches are rarely for specific brands but rather based around certain actions, reactions or emotions. With the forthcoming sponsored messaging product, a search for &ldquo;Wooo&rdquo; might turn up a GIF of someone pouring Jose Cuervo shots. A search for &ldquo;cheers&rdquo; might show folks clinking two Budweiser beer bottles together. (If Netflix doesn&rsquo;t buy ads against &ldquo;chill,&rdquo; I&rsquo;ll be really disappointed.)\nWhat&rsquo;s more, sponsored content on Giphy would function in a way similar to Snapchat&rsquo;s sponsored face filters. Even if it includes branded content, the fact that it comes from a friend makes it worth watching and makes it easier to connect with.\nThe same source also said that Giphy is now seeing 200 million daily active users between both the API and website, with around 250 million monthly active users on the website, as well as Giphy&rsquo;s owned and operated integrations. That means the majority of Giphy&rsquo;s users are interacting with the service every single day.\nNeither my source, nor Giphy, would confirm a timeline for the launch of ad products. That said, Giphy COO Adam Leibsohn did confirm that the company has shifted focus from growth to building ad products, without adding much detail on what those products might look like.\n&ldquo;With GIPHY Studios, we&rsquo;ve been executing on creative partnerships for over a year,&rdquo; said Leibsohn. &ldquo;That work helps inform our thinking and exploration around what our ad products will look like.&rdquo;\nI also asked Leibsohn which brands would be the first to test out Giphy&rsquo;s ad products.\n&ldquo;We already work closely with the world&rsquo;s leading brands in content, entertainment, technology and advertising,&rdquo; said Leibsohn. &ldquo;When we&rsquo;re ready to launch our ad products, it naturally follows that we&rsquo;ll be working with our existing partners.&rdquo;\nAs far as testing is concerned, it&rsquo;s unclear which platform Giphy will wade into first. Nor is it clear what sort of a business model sponsored content would take when served on a third-party platform, outside of Giphy&rsquo;s own site and app.\nSlack, iMessage, Facebook Messenger and Twitter are all huge platforms for Giphy, but they may be a little too big to do initial testing. Remember, Giphy is the same company that launches standalone app after standalone app simply to learn what will and won&rsquo;t work with its users.\nStrategically, the best place for Giphy to start testing sponsored content would be Tinder, in my opinion. Tinder has an integration with Giphy that gets a lot of play &mdash; in fact, one of the top 25 most popular Giphy GIFs from last year climbed the charts courtesy of Tinder users.\n\nAnd while Tinder and Giphy are a match made in (user engagement) heaven, it&rsquo;s not as high-stakes as debuting an ad product on a public platform like Twitter, nor is it as tricky or unpredictable as the mostly professional environment of Slack.\nTinder did not immediately respond to a request for comment.\nGiphy has a lot of options when it comes to generating revenue. Alongside selling sponsored content within messaging, the company also sees a ton of traffic to the Giphy website. In fact, Giphy says that more than 50 percent of the people who come to the company&rsquo;s website are coming with the intent to browse.\nThis opens up the opportunity to sell native ads, via search terms, on the website, too.\nPlus, Giphy currently works to &lsquo;live-gif&rsquo; big events like the Oscars, Golden Globes, etc. For now, Giphy&rsquo;s team does this for free, but you can see how they might eventually start inking licensing deals around these events. And that doesn&rsquo;t even include the troves of old content &mdash; think &ldquo;Full House&rdquo; and &ldquo;Seinfeld&rdquo; &mdash; that Giphy turns into GIFs for big broadcast and cable networks.\nWhile many believe that P2P native content will be a huge part of the future of advertising, it hasn&rsquo;t become immediately clear what a successful version of that will actually look like. But, in a relatively short time, Giphy has become an ingrained part of the way we communicate, whether it&rsquo;s in iMessage, on Twitter, Tinder or Slack.\nGiphy picked up $72 million in October 2016, bringing total raised to $150 million at a reported valuation of $600 million.","user_id":"Ed Orsini","link":"https://techcrunch.com/2017/07/31/with-200m-daily-users-giphy-will-soon-test-sponsored-gifs/"},{"title":"GitHub: getify/You-Dont-Know-JS","description":"You-Dont-Know-JS - A book series on JavaScript. @YDKJS on twitter.","user_id":"Walter Augustine","link":"https://github.com/getify/You-Dont-Know-JS"},{"title":"GitHub: denysdovhan/wtfjs","description":"wtfjs - A list of funny and tricky JavaScript examples","user_id":"Ed Orsini","link":"https://github.com/denysdovhan/wtfjs"},{"title":"YouTube Video: dotJS 2012 - Brian Leroux - WTFJS","user_id":"Walter Augustine","link":"https://www.youtube.com/watch?v=et8xNAc2ic8"},{"title":"reddit: A home for ideas by people who lack time, money, or skills. • r/SomebodyMakeThis","description":"reddit: the front page of the internet","user_id":"Walter Augustine","link":"https://www.reddit.com/r/SomebodyMakeThis/"},{"title":"Sessions College: Color Wheel - Color Calculator | Sessions College","description":"Use the color wheel to find the perfect color scheme with the Sessions College color calculator. Endless free color combinations, working from any base color.","user_id":"Kelsey Hayes","link":"https://www.sessions.edu/color-calculator/"},{"title":"In love with colors, since 2002. A designer tool for creating color combinations that work together well. Formerly known as Color Scheme Designer. Use the color wheel to create great color palettes.","description":"In love with colors, since 2002. A designer tool for creating color combinations that work together well. Formerly known as Color Scheme Designer. Use the color wheel to create great color palettes.","user_id":"Kelsey Hayes","link":"http://paletton.com/#uid=33Y1o0kl6lPawxafQr6qegIvBbi"},{"title":"#a8cc7f Color Hex","description":"#a8cc7f color hex, #a8cc7f color chart,rgb,hsl,hsv color number values, html css color codes and html code samples.","user_id":"Kelsey Hayes","link":"http://www.color-hex.com/color/a8cc7f"},{"title":"CSS-Tricks: CSS Triangle | CSS-Tricks","description":"HTML You can make them with a single div. It's nice to have classes for each direction possibility. CSS The idea is a box with zero width and height. The a","user_id":"Walter Augustine","link":"https://css-tricks.com/snippets/css/css-triangle/"},{"title":"CodePen: Animation to Explain CSS Triangles","description":"I've been wanting to do this forever, but this Pen <http://codepen.io/Tresva/pen/dxHsb> finally pushed me over the edge to do it. Hacker news if anyone ...","user_id":"Walter Augustine","link":"https://codepen.io/chriscoyier/pen/lotjh"},{"title":"How to Use Google and Other Tips for Finding Programming Help - CodeProject","description":"A primer for people looking to learn to help themselves find answers to programming questions; Author: Christian Graus; Updated: 8 Mar 2008; Section: Programming Tips; Chapter: General Programming; Updated: 8 Mar 2008","user_id":"Michael Alley","link":"https://www.codeproject.com/Articles/24213/How-to-Use-Google-and-Other-Tips-for-Finding-Progr"},{"title":"State Of JavaScript: The State Of JavaScript","description":"A short survey about current popular JavaScript technologies.","user_id":"Walter Augustine","link":"http://stateofjs.com/"},{"title":"Bootstrap","description":"The most popular HTML, CSS, and JS library in the world.","user_id":"Walter Augustine","link":"https://getbootstrap.com/"},{"title":"How, in general, does Node.js handle 10,000 concurrent requests?","description":"I understand that Node.js uses a single-thread and an event loop to process requests only processing one at a time (which is non-blocking). But still, how does that work, lets say 10,000 concurrent","user_id":"Tyler Schade","link":"https://stackoverflow.com/questions/34855352/how-in-general-does-node-js-handle-10-000-concurrent-requests"},{"title":"npm Documentation","description":"The place where all things npm are documented","user_id":"Walter Augustine","link":"https://docs.npmjs.com/"},{"title":"wikipedia: List of HTTP status codes","description":"This is a list of Hypertext Transfer Protocol (HTTP) response status codes. It includes codes from IETF Request for Comments (RFCs), other specifications, and some additional codes used in some common applications of the Hypertext Transfer Protocol (HTTP). The first digit of the status code specifies one of five standard classes of responses. The message phrases shown are typical, but any human-readable alternative may be provided. Unless otherwise stated, the status code is part of the HTTP/1.1 standard (RFC 7231).\nThe Internet Assigned Numbers Authority (IANA) maintains the official registry of HTTP status codes.\nMicrosoft Internet Information Services (IIS) sometimes uses additional decimal sub-codes for more specific information, however these sub-codes only appear in the response payload and in documentation, not in the place of an actual HTTP status code.","user_id":"Tyler Schade"},{"title":"Mockaroo  - Random Data Generator | CSV / JSON / SQL / Excel","description":"A free test data generator - Mockaroo lets you create custom CSV, JSON, SQL, and Excel datasets to test and demo your software.","user_id":"Walter Augustine","link":"https://mockaroo.com/"},{"title":"Telerik Developer Network: Understanding Scope in JavaScript","description":"Scope tells the compiler where to look for variables &amp; functions when it needs them - Wissam Abirached explains the different ways this works in JavaScript.","user_id":"Ed Orsini","link":"https://developer.telerik.com/topics/web-development/understanding-scope-in-javascript/"},{"title":"The Practical Dev: 10 JavaScript concepts you need to know for interviews","description":"From the <http://dev.to|dev.to>() community. Sharing ideas that makes us all better developers.","user_id":"Ed Orsini","link":"https://dev.to/arnavaggarwal/10-javascript-concepts-you-need-to-know-for-interviews"},{"title":"YouTube Video: Prototypes in JavaScript - FunFunFunction #16","user_id":"Kelsey Hayes","link":"https://www.youtube.com/watch?v=riDVvXZ_Kb4"},{"title":"YouTube: Fun Fun Function","description":"I’m Mattias Petter Johansson, mpj for short. I’ve been a full-time programmer for about ten years. I’ve worked for Absolut Vodka, Blackberry and currently wo...","user_id":"Kelsey Hayes","link":"https://www.youtube.com/channel/UCO1cgjhGzsSYb1rsB4bFe4Q"},{"title":"Udemy: Udemy Online Courses - Learn Anything, On Your Schedule","description":"Udemy is an online learning and teaching marketplace with over 45,000 courses and 15 million students. Learn programming, marketing, data science and more.","user_id":"Walter Augustine","link":"https://www.udemy.com/"},{"title":"npm: mysql","description":"A node.js driver for mysql. It is written in JavaScript, does not require compiling, and is 100% MIT licensed.","user_id":"Walter Augustine","link":"https://www.npmjs.com/package/mysql"},{"title":"Getting MySQL path in command prompt","description":"How can i get the mysql installation path up to bin folder using command prompt in <http://windows.Is|windows.Is> there any command to get the location of mysql installation path?","user_id":"Walter Augustine","link":"https://stackoverflow.com/questions/14805567/getting-mysql-path-in-command-prompt"},{"title":"How to add MySQL to $PATH variable to resolve \"mysql: command not found\"?","description":"I installed MySQL on my Mac, and now I would like to add it to my $PATH variable. I want to be able to type mysql anywhere. I tried adding the following to my .profile file: export PATH=${PATH}/usr/","user_id":"Walter Augustine","link":"https://apple.stackexchange.com/questions/176786/how-to-add-mysql-to-path-variable-to-resolve-mysql-command-not-found"},{"title":"SitePoint: Understanding JOINs in MySQL and Other Relational Databases","description":"SQL JOINs are often misunderstood and one of the biggest causes of database optimization problems. This brief tutorial explains JOINs and their use in MySQL and other relational databases.","user_id":"Ross Blair","link":"https://www.sitepoint.com/understanding-sql-joins-mysql-database/"},{"title":"Axess Lab: How icons are ruining interfaces - Axess Lab","description":"Icons used correctly can enhance both the user experience and look of your interface. Sadly, more and more designers are using them in the wrong way. And it’s hurting both the usability and accessibility of the interface. My dad and his TED app I love to watch my dad use technology. It’s such a great …","user_id":"Walter Augustine","link":"https://axesslab.com/icons-ruining-interfaces/"},{"title":"GitHub: mr-mig/every-programmer-should-know","description":"every-programmer-should-know - A collection of (mostly) technical things every software developer should know","user_id":"Walter Augustine","link":"https://github.com/mr-mig/every-programmer-should-know"},{"title":"Atlassian: Git cheat sheet | Atlassian Git Tutorial","description":"Git cheat sheet that serves as a quick reference for basic Git commands to help you learn Git. Git branches, remote repositories, undoing changes, and more","user_id":"Walter Augustine","link":"https://www.atlassian.com/git/tutorials/atlassian-git-cheatsheet"},{"title":"Explain and example about 'get', 'delete', 'post', 'put', 'options', 'patch', 'head' method?","description":"I'm writing a webservice. Could any one explain these above methods and give me some example about them? Thank for your help.","user_id":"Walter Augustine","link":"https://stackoverflow.com/questions/27030649/explain-and-example-about-get-delete-post-put-options-patch-h"},{"title":"HTTP Status Codes","description":"HTTP status codes and how to use them in RESTful API or Web Services.","user_id":"Walter Augustine","link":"http://www.restapitutorial.com/httpstatuscodes.html"},{"title":"ogsite_name: Fresh Brewed Frontend","description":"Fresh Brewed Frontend is THE web developer newsletter for those looking to focus on the latest news, best practices, and techniques in frontend development. We find the content worth reading so you won't have to.","user_id":"Walter Augustine","link":"https://freshbrewed.co/frontend/"},{"title":"Code School: Express.js Tutorial | Code School","description":"Express provides more robust features to your web application. Learn how to build Web APIs in Node using Express.","user_id":"Ed Orsini","link":"https://www.codeschool.com/courses/building-blocks-of-express-js"},{"title":"Online Markdown Editor - Dillinger, the Last Markdown Editor ever.","description":"Dillinger is an online cloud based HTML5 filled Markdown Editor. Sync with Dropbox, Github, Google Drive or OneDrive. Convert HTML to Markdown. 100% Open Source!","user_id":"Walter Augustine","link":"https://dillinger.io/"},{"title":"GitHub: remy/nodemon","description":"nodemon - Monitor for any changes in your node.js application and automatically restart the server - perfect for development","user_id":"Walter Augustine","link":"https://github.com/remy/nodemon"},{"title":"Sails.js | Realtime MVC Framework for Node.js","description":"Sails.js makes it easy to build custom, enterprise-grade Node.js apps. It is designed to resemble the MVC architecture from frameworks like Ruby on Rails, but with support for the more modern, data-oriented style of web app development. It's especially good for building realtime features like chat.","user_id":"Walter Augustine","link":"http://sailsjs.com/"},{"title":"Code School Blog: 10 Web Development Podcasts You Should Be Subscribed To - Code School Blog","description":"As a developer, it’s crucial to practice your craft to keep your skills sharp.","user_id":"Kelsey Hayes","link":"https://www.codeschool.com/blog/2015/11/20/10-web-development-podcasts-you-should-be-subscribed-to/"},{"title":"Should PUT and DELETE be used in forms?","description":"Assuming my web application has full support of PUT and DELETE on the server side, should I make use of them? Basically my question is how many browsers support this: &lt;form method=\"PUT\"&gt; ...","user_id":"Walter Augustine","link":"https://stackoverflow.com/questions/5162960/should-put-and-delete-be-used-in-forms"},{"title":"CSS-Tricks: \"The Notch\" and CSS | CSS-Tricks","description":"Apple's iPhone X has a screen that covers the entire face of the phone, save for a \"notch\" to make space for a camera and other various components. The res","user_id":"Walter Augustine","link":"https://css-tricks.com/the-notch-and-css/"},{"title":"WebKit: Designing Websites for iPhone X","user_id":"Walter Augustine","link":"https://webkit.org/blog/7929/designing-websites-for-iphone-x/"},{"title":"TodoMVC","description":"Helping you select an MV* framework - Todo apps for Backbone.js, Ember.js, AngularJS and many more","user_id":"Walter Augustine","link":"http://todomvc.com/"},{"title":"RegexOne - Learn Regular Expressions - Lesson 1: An Introduction, and the ABCs","description":"RegexOne provides a set of interactive lessons and exercises to help you learn regular expressions","user_id":"Walter Augustine","link":"https://regexone.com/"},{"title":"Regex101 - online regex editor and debugger","description":"Regex101 allows you to create, debug, test and have your expressions explained for PHP, PCRE, Python, Golang and JavaScript. The website also features a community where you can share useful expressions.","user_id":"Walter Augustine","link":"https://regex101.com/#javascript"},{"title":"plainJS - fast and lightweight JavaScript tools","description":"Vanilla JavaScript for writing powerful web applications without jQuery.","user_id":"Walter Augustine","link":"https://plainjs.com/"},{"title":"freeCodeCamp: I spent 3 months applying to jobs after a coding bootcamp. Here’s what I learned.","description":"A less-talked about part of the bootcamper’s journey is what happens after you graduate — when you’re searching for that six-figure…","user_id":"Tyler Schade","link":"https://medium.freecodecamp.org/5-key-learnings-from-the-post-bootcamp-job-search-9a07468d2331"},{"title":"HNPWA","description":"Hacker News readers as Progressive Web Apps","user_id":"Walter Augustine","link":"https://hnpwa.com/"},{"title":"Moocha - Search engine for online courses","description":"Search for MOOCs and online courses from platforms including Coursera, edX, MIT OpenCoursWware, Udacity, and Futurelearn.","user_id":"Walter Augustine","link":"https://www.moocha.io/"},{"title":"YouTube Video: Sequelize + Handlebars Review","user_id":"Ed Orsini","link":"https://www.youtube.com/watch?v=EDgpYNqItmc&amp;index=1-ZiCqgm3dw7Cvrewq2"},{"title":"Mozilla Developer Network: Strict mode","description":"ECMAScript 5 's strict mode is a way to opt in to a restricted variant of JavaScript. Strict mode isn't just a subset: it intentionally has different semantics from normal code. Browsers not supporting strict mode will run strict mode code with different behavior from browsers that do, so don't rely on strict mode without feature-testing for support for the relevant aspects of strict mode. Strict mode code and non-strict mode code can coexist, so scripts can opt into strict mode incrementally.","user_id":"Walter Augustine","link":"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Strict_mode"},{"title":"Chai","description":"Chai is a BDD / TDD assertion library for [node](<http://nodejs.org>) and the browser that can be delightfully paired with any javascript testing framework.","user_id":"Walter Augustine","link":"http://chaijs.com/"},{"title":"GitHub: segmentio/nightmare","description":"nightmare - A high-level browser automation library.","user_id":"Walter Augustine","link":"https://github.com/segmentio/nightmare"}]